Revit 2027 API
SpaceFilter Constructor
 Constructs a filter which matches only spaces.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpaceFilter()
Public Sub New
public:
SpaceFilter()
new : unit -> SpaceFilter
See Also
Reference
SpaceFilter Class
Autodesk.Revit.DB.Mechanical Namespace